{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "dropout": 0.0, "dtype": "float32", "kernel_constraint": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "batch_input_shape": [null, null, 1], "return_sequences": true, "units": 50, "implementation": 0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "stateful": false, "trainable": true, "activation": "tanh", "unroll": false, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "units": 100, "implementation": 0, "recurrent_activation": "hard_sigmoid", "stateful": false, "trainable": true, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.0.2"}